<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Matiere;
class MatiereSeeder extends Seeder
{
    public function run()
    {
        $matieres = [
            'اللغة العربية',
            'اللغة الفرنسية',
            'اللغة الإنجليزية',
            'التاريخ والجغرافيا',
            'الرياضيات',
            'العلوم الفيزيائية والتكنولوجيا',
            'العلوم الطبيعية',
            'التربية البدنية والرياضية',
            'العلوم الفيزيائية',
            'الأدب العربي',
            'العلوم الإسلامية',
            'الفلسفة',
            'علوم الطبيعية والحياة',
            'العلوم الاقتصادية',
            'الهندسة الكهربائية',
            'الموسيقى',
            'الإعلام الآلي',
            'اللغة الإسبانية',
            'الرسم',
            'الهندسة المدنية',
            'الهندسة الميكانيكية',
            'اللغة الألمانية',
            'هندسة الطرائق',
        ];

        foreach ($matieres as $matiere) {
            Matiere::create(['name' => $matiere]);
        }
    }
}
